[
  {
    "LinkedContentID": "Task_L5_T1",
    "Title": "Скопировать массивы",
    "Description": "Вам необходимо реализовать метод, который возвращает копию переданного массиива размеров яблок.",
    "Tips": [
      "Создай новый массив, который будет копией изначального.",
      "Пройдись циклом по изначальному массиву и передай значения каждого элемента в новый массив."
    ]
  },
  {
    "LinkedContentID": "Task_L5_T2",
    "Title": "Выбрать дрова",
    "Description": "Вам необходимо релизовать метод, возвращяющий массив bool такого же размера, как и входной масиив размер полена.\n В зависимости от того подходит ли размер полена или нет в выходном массиве по соответствующему индексу должно быть true или false сообветственно.\n Полено подходит, если его размер меньше либо равен переданному размеру.",
    "Tips": [
      "Создай массив bool, длина которого равна данному массиву брёвен.",
      "Заполняй новый массив в цикле, сравнивая каждый элемент массива брёвен с необходимой длиной."
    ]
  },
  {
    "LinkedContentID": "Task_L5_T3",
    "Title": "Скам мамонта",
    "Description": "Вам необходимо реализовать метод, который выбирает, какой картой походить(или же спасовать)\n На вход передается доступный набор карт и ход противника.\n Необходимо вернуть достоинство карты, которой нужно отбиваться, либо -1 если игрок пасует.\n Ходить необходимо картой с наименьшем подходящим достоинством,т.е. большим достоинством, чем карта, которой походил противник, либо тузом, если ничего другого подходящего нет.\n Достоинство карт их номер от 1 до 13. Туз, 2-10,валет, дама, король.\n Следует помнить, что туз хоть и имеет наименьшее достоинство, является картой, бьющей все остальные(кроме туза соответсвенно).\n У игрока может быть несколько карт с одинаковым достоинством.",
    "Tips": [
      "Сравнивай значения своих карт со значением карты противника."
    ]
  },
  {
    "LinkedContentID": "Task_L5_T4",
    "Title": "Сохранение пути",
    "Description": "Вам необходимо реализовать метод, который преобразует массив enum-ов в массив чисел для более удобного хранения. На вход передается массив enum-ов Direction, который может быть West, Nort, South, East.",
    "Tips": [
      "Каждое значение Enum-а имеет также численное значение, начиная с 0."
    ]
  },
  {
    "LinkedContentID": "Task_L5_T5",
    "Title": "Проверить массив",
    "Description": "Вам необходимо реализовать метод, который проверяет массив на соответствие критериям. Критерии: массив не null, массив имеет хотя бы 1 элемент, первый элемент массива не 0.",
    "Tips": [
      "Здесь тебе помогут логические операторы. Если нужно вспомнить их, открой справочник."
    ]
  },
  {
    "LinkedContentID": "Task_L5_T6",
    "Title": "Двумерный массив",
    "Description": "Вам необходимо реализовать метод, который возвращает нужный элемент двумерного массива. На вход передается двумерный массив, цвет в виде enum Color{Red,White,Grey}, и форма в виде enum Form{Gear,Triangle,Square}.\n Цвет соответствует первой координате, форма -- второй.",
    "Tips": [
      "Тебе могут пригодиться вложенные циклы."
    ]
  },
  {
    "LinkedContentID": "Task_L5_T7",
    "Title": "Перевозимый вес",
    "Description": "Вам необходимо реализовать метод который обрабатывает массив максимально перевозимого веса для лодки. Вам необходимо заменить вес на -1 для лодок, которые не смогут перевезти груз, вес которого передается на вход. Необходимо вернуть измененную копию массива.",
    "Tips": [
      "Разумеется, без циклов тут никуда! :)"
    ]
  }
]