[
  {
    "LinkedContentID": "Story_L5_P1",
    "Articles": [
      "Уже светало в то время, когда робот увидел неподалёку дым из труб и крыши домов. Это была деревня. И похоже, кто-то из жителей идёт в её сторону.",
      "Это была старушка, которая обронила корзину с яблоками и пыталась подобрать её.",
      "Робот подошёл к ней, чтобы помочь. Женщина опешила и встала как вкопанная, не ожидав увидеть здесь железного помощника. Но робот, несмотря на это, продолжил собирать яблоки."
    ]
  },
  {
    "LinkedContentID": "Story_L5_P2",
    "Articles": [
      "Женщина тихо поблагодарила робота и поспешила в деревню. Нашего же героя привлёк звук топора, доносившийся из-за кустов.",
      "Робот пошёл туда и встретил дровосека. Он всё это время наблюдал, как робот собирал яблоки, и похоже, совсем не испугался железного незнакомца. Напротив, он попросил героя об услуге - отнести дров для костра торговцу."
    ]
  },
  {
    "LinkedContentID": "Story_L5_P3",
    "Articles": [
      "Робот отлично сработал и отправился выполнять поручение дровосека.",
      "Торговец был совсем рядом. Наш герой отдал ему дрова, за что удостоился благодарности со стороны местных жителей. У костра их было двое - торговец и его товарищ.",
      "Второй предложил роботу поиграть в карточную игру: взять несколько карт, запомнить их, а затем постараться вытянуть наибольшую, чтобы победить соперника. Память у нашего героя была безупречной, а потому он согласился сыграть."
    ]
  },
  {
    "LinkedContentID": "Story_L5_P4",
    "Articles": [
      "Железный помощник вытянул самую большую карту из имеющихся, но проиграл - у друга торговца оказались карты посильнее. Тогда робот решил закончить игру и двинуться дальше.",
      "Неподалёку был трактир, и робот решил уточнить у работников, как добраться до замка в горах.",
      "Его уже не боялись, а горячо приветствовали - та женщина, которая обронила яблоки, рассказал всем о доброте и великодушии железного человека. Работник трактира принёс карту и стал показывать роботу маршрут."
    ]
  },
  {
    "LinkedContentID": "Story_L5_P5",
    "Articles": [
      "Дорога на востоке вела к замку, но так как ещё было раннее утро, робот решил пройтись по деревне и посмотреть, чем занимаются её жители. Его привлёк некто в чёрном одеянии.",
      "Это был старейшина. Он каждое утро выходит полюбоваться рассветом и тем, как в деревне начинает кипеть жизнь. Робот поинтересовался, может ли он чем-нибудь помочь жителям. Старейшина предложил помощнику дойти до берега и спросить мельника и лодочника.",
      "Робот собирался было идти, но старейшина попросил ещё ненадолго задержаться. Ему было очень любопытно узнать чуть больше о нашем герое, точнее, о его умственных способностях и смекалке, и загадал загадку - в какой руке он держит камушек?"
    ]
  },
  {
    "LinkedContentID": "Story_L5_P6",
    "Articles": [
      "Робот правильно ответил на вопрос старейшины и двинулся к берегу, к мельнице.",
      "Он увидел грустного мельника, сидящего на скамейке. Поговорив с жителем, робот узнал, что у мельницы вышли из строя несколько шестерёнок, и поэтому она не работает.",
      "Наш герой решил помочь мельнику и принялся осматривать стоящий рядом ящик с различным хламом и металлоломом. Быть может, внимательному роботу удасться найти что-нибудь подходящее на замену."
    ]
  },
  {
    "LinkedContentID": "Story_L5_P7",
    "Articles": [
      "Все подходящие детали были найдены, и через некоторое время мельник смог починить мельницу. Горячо поблагодарив робота, он стал любоваться вновь работающим механизмом, а наш герой решил пройтись до лодочника.",
      "Оказалось, ему тоже не помешала бы помощь. Он недавно закончил изготовление нескольких лодок и нужно было проверить, как много груза они способны удерживать на воде. Наш герой здесь очень бы пригодился."
    ]
  },
  {
    "LinkedContentID": "Story_L5_P8",
    "Articles": [
      "Работа была успешно выполнена. На дворе уже стоял день, а значит теперь можно двигаться дальше. Робот вернулся в центр деревни и нашёл нужную дорогу.",
      "Робот пошел по этой дороге на встречу приключениям",
      "Робот попращался с теми, кто встречался у него на пути и покинул это место и двинулся дальше. Он был всё ближе к горам, где его ждал замок с сокровищами."
    ]
  }
]
