[
  {
    "Articles": [
      "Роботу удалось перевести слова местного фермера и, заручившись указаниями, он отправился дальше. Его путь пролегал через холмистые поля и равнины, освещенные ярким солнцем.",
      "Поднимаясь на очередную возвышенность, он увидел на горизонте тот самый замок, который наблюдал издали, с вершины горного хребта. Ослепительно белый, он возвышался над землей. Множество башен разных высот дополняли и расширяли уже и так необъятную постройку.",
      "Робот немедля направился к замку, его ноги двигались все быстрее, он спешил войти внутрь, спешил узнать, что там, за его стенами.",
      "Наконец, путешественник подобрался поближе. Навстречу ему никто не вышел и даже не выглянул из окон. Из-за стен не доносилось ни единого звука.",
      "Остановившись, робот еще раз окинул взглядом замок. Он стоял здесь уже давно, но, будто возникший из ниоткуда и только что, выглядел неестественно идеальным: кладка была ровной, не было ни щелей, ни трещин, ни сколов; стены имели равномерно белый окрас, без пятен и грязи. Это обособленное место казалось каким-то искусственным, неживым, оно было воплощением идеального порядка.",
      "Дальнейший путь роботу преграждал глубокий ров с водой. На другом берегу вертикально стоял откидной мост, который удерживали старые цепи. Путешественник заметил, что звено одной из цепей уже почти порвано, и если в него чем-нибудь попасть, то возможно, получится пробраться внутрь замка…"
    ]
  },
  {
    "Articles": [
      "Камень попал в цель и выбил поврежденное звено. Всю конструкцию потащило вниз, вторая цепь, не выдержав нагрузки, тоже дала слабину, мост и с грохотом рухнул через ров.",
      "Робот прошел по нему сквозь арку и попал на обширную чистую площадь.",
      "Здесь было тихо, абсолютно безлюдно и пусто. Ветер гонял сухие листья по холодному камню, и кроме них на белом фоне выделялась лишь пара давно умерших деревьев.",
      "Путешественник проходил мимо пустых клумб и высохших фонтанов, с опаской оглядываясь по сторонам.",
      "Затем он ускорил шаг, желая поскорее покинуть это неуютное открытое пространство, и не заметил, как уперся в белую стену. Он отошел подальше, чтобы целиком охватить ее взглядом.",
      "Это были две массивные створки огромной высоты - робот дошел прямо до главных ворот замка.",
      "Он попытался  потянуть за ручки, но створки не сдвинулась с места и даже не издали никакого звука.",
      "Задумавшись, робот услышал странное монотонное тиканье и решил проверить, откуда оно исходит. Сбоку правой створки, на стене он увидел механическое устройство, похожее на кодовый барабанный замóк, однако в нем было кое-что необычное для изделий подобного рода: кольца, которые предполагается крутить вручную, двигались сами по себе с небольшими паузами, издавая характерные щелчки.",
      "Робот подошел поближе и присмотрелся к гравировке на кольцах: на каждом из них было начертано нечто, напоминающее математические скобки. Немного правее замка́ располагалась небольшая кнопка с изображением разделенной по вертикали окружности. Робот предположил, что эти половинки окружности на рисунке вполне могли бы символизировать парные скобки…"
    ]
  },
  {
    "Articles": [
      "Толстые шестерни в стенах за́мка начали работать, издавая тяжелый металлический звук, и вместе с этим двери медленно открывались в стороны. Робот протиснулся внутрь и попал в большой тронный зал.",
      "Он оказался в белом просторном помещении с бесконечно высокими потолками, наполненном светом из множества окон. Подобно площади, оно было пустое и чистое: в нем отсутствовали яркие украшения, позолоченные элементы и знамена. Единственным, что сразу бросалось в глаза на фоне всего остального, было черно-белое поле на полу, прямо по центру, напоминающее шахматную доску. В самом конце зала располагалась широкая пирамида, на последней ступени которой на небольшом каменном троне сидел робот с опущенной вниз головой. Судя по-всему, он уже давно не включался. Вопросов становилось только больше.",
      "Путешественник сделал пару шагов от входа вперед и услышал громкий хлопок, за которым последовало долгое раскатистое эхо. Он резко обернулся - дверь была закрыта.",
      "Понимая, что назад дороги нет, робот решил пройти дальше и осмотреться. Вскоре он заметил, что здесь не было ни одной двери, ни одного прохода в другие помещения, что странно, учитывая размеры замка. Предметы быта и убранства в замке также отсутствовали.",
      "Возле черно-белой сетки на полу робот увидел на стойке небольшую панель, похожую на какое-то древнее механическое устройство. Он подошел ближе и нажал на центральную кнопку.",
      "Прямо у него под ногами загудели какие-то механизмы, и через пару секунд из под пола начали медленно подниматься шахматные фигуры. Размеры этих статуй были внушительными, некоторые даже превышали рост робота. Похоже, это и вправду было игровое поле. Робот нажал на другую кнопку: механизмы где-то в глубине снова начали свою работу, и одна из шахматных фигур с его стороны сдвинулась на соседнюю клетку. Через пару мгновений статуя с противоположного конца переместилась в ответ.",
      "Путешественник решил принять участие в этой игровой партии королевских масштабов."
    ]
  },
  {
    "Articles": [
      "Наконец, долгая партия подошла к концу - робот одержал победу, но кое-что для него всё ещё оставалось загадкой: против кого же он играл? Пока он пытался найти ответ на этот вопрос, оставшиеся фигуры медленно и равномерно опускались обратно вниз, под шахматное поле. Вскоре в зале воцарилась полная тишина.",
      "Путешественник решил, наконец, получше рассмотреть того, находился на троне. Он аккуратно поднялся по ступеням и подошел ближе: это был очень старый и невероятно искусно сконструированный робот. На его корпусе были видны открытые детали, шестерёнки, различные трубки, которые должны были приводить его в движение. Он был создан еще задолго до цифровой эпохи и, кажется, работает от какого-то заводного механизма.",
      "Посмотрев по сторонам, робот заметил в небольших арках, вырезанных в стене еще несколько подобных древних изделий. Они были выполнены чуть грубее и примитивнее, и каждое из них держало в руках меч. Судя по всему, это были стражи, которым предназначалось охранять это место.",
      "Путешественник вернул свой взгляд на робота, сидевшего на троне. У него не было оружия, однако в его правой ладони находился странный предмет кубической формы, имеющий примерно то же происхождение, что и его владелец: он был похож на какой-то механический артефакт или очень сложную конструкцию с кучей шестерней и подвижных деталей, являющуюся частью чего-то еще более сложного. Робот протянул руку к кубу.",
      "Не успел он до него дотронуться, как вдруг, сбоку раздался металлический грохот. Путешественник вздрогнул и обернулся в сторону шума: двое стражей направлялись прямо к нему. Их движения были резкими и уверенными.",
      "Один из них сразу начал постепенно замедляться, пока в конце концов полностью не остановился, другой же продолжал наступать. Робот сделал пару шагов назад, но страж быстро сблизился с ним и начал наносить один удар за другим.",
      "Путешественник только успевал уклоняться и отходить всё дальше и дальше. Судя по тому, что активировались всего два стража, а один из них довольно быстро замер, роботу нужно было лишь продержаться некоторое время, пока заводной механизм последнего полностью не остановится."
    ]
  },
  {
    "Articles": [
      "Заводной механизм стража с каждой секундой тикал все реже и реже, пока, наконец, полностью не умолк. Робот осторожно подошел к нему и ткнул пару раз в корпус. Страж лишь немного покачался.",
      "Удостоверившись, что опасность миновала, путешественник поднялся по ступеням еще раз посмотреть на загадочный артефакт. Он взял его и покрутил в руках: куб оказался довольно увесистым для своих размеров. Всё его множество разных деталей были сделаны из металла, по цвету напоминающего золото или медь. Кажется, он когда-то ярко блестел на свету, переливаясь жёлтыми бликами, но давно утратил эту черту из-за рабочих царапин и потертостей.",
      "“Это должно куда-то подходить…” - подумал путешественник и начал искать, для чего этот предмет мог быть предназначен. Обойдя весь зал вдоль и поперек, он так и не нашел ему подходящего места и тогда решил положить изделие обратно",
      "Вновь поднявшись по ступеням, он подошел к неподвижному древнему роботу, и возвращая артефакт ему в ладонь, заметил сквозь пальцы его правой руки какое-то углубление в подлокотнике трона. Он отодвинул руку и увидел квадратное отверстие, на внутренних стенках которого находились шестеренчатые механизмы, такие же, как и на гранях куба снаружи. Всё выглядело так, как будто они должны соединяться друг с другом и работать вместе.",
      "Робот поместил артефакт в углубление, немного подвигал его из стороны в сторону, и шестерни состыковались. После он попробовал покрутил один из дисков на верхней грани куба: все детали пришли в движение, издавая характерный звук, уходящий куда-то далеко вниз, и из под пола начали подниматься уже знакомые роботу шахматные фигуры.",
      "Он поспешно повернул диск в обратном направлении, при этом случайно задев еще один, находившийся рядом. После этого фигуры опустились обратно, и следом в стене напротив приоткрылась дверь, ведущая в другие помещения. Раньше робот её даже не замечал: настолько сильно она сливалась с окружением. Похоже, куб является своего рода ключом, с помощью которого можно управлять этим механическим зáмком, и теперь робот является его обладателем. Неизвестно, что стало с предыдущим владельцем, посмертно сидящем на троне, но судя по всему, его правление закончилось неудачно и уже очень давно. Робот подумал, что для начала, ему стоит разобраться, как открыть центральные ворота, ведь они по прежнему были заперты. Однако, действовать наугад, повернув все диски сразу, было неразумно: под контролем этого ключа могло находиться всё, что угодно, в том числе и активация стражей. В механизме управления определенно должна была быть какая-то закономерность, поэтому робот решил детально изучить ее."
    ]
  },
  {
    "Articles": [
      "Игра окончена!"
    ]
  }
]
