[
  {
    "LinkedContentID": "Story_L3_P1",
    "Articles": [
      "Вскоре после начала своего путешествия робот стал всё чаще видеть высокие деревья по обе стороны тропы. Он забрёл в самую гущу леса.",
      "К счастью (и одновременно сожалению), робот встал на перепутье. Стало ясно, что здесь он не потеряется, но было абсолютно непонятно, куда ему идти. Стоящий перед ним указатель мог помочь решить эту проблему."
    ]
  },
  {
    "LinkedContentID": "Story_L3_P2",
    "Articles": [
      "Наш герой решил свернуть направо и двинулся по хорошо виднеющейся тропе дальше.",
      "Немного повернув, он заметил что-то необычное чуть поодаль и поспешил туда.",
      "Повозка с брёвнами, срубленные деревья и топор в пне дали ясно ему понять - это излюбленное место дровосеков. Рядом никого не было, а потому робот решил помочь им в их нелёгком труде. В конце концов, для помощи другим он и был создан."
    ]
  },
  {
    "LinkedContentID": "Story_L3_P3",
    "Articles": [
      "И вот работа окончена! Те, кто здесь трудятся, определённо оценят помощь железного друга.",
      "Однако двигаться дальше было некуда, а потому роботу пришлось вернуться на перепутье и пойти другой дорогой.",
      "На очередном перекрёстке он хотел было свернуть вправо, но кое-что привлекло его внимание.",
      "Это были лесные грибы. Нашему герою они были знакомы, но тут их росло в куда большем количестве. \"А что если сорвать один из них?\" - подумал он и стал выбирать для себя самый интересный."
    ]
  },
  {
    "LinkedContentID": "Story_L3_P4",
    "Articles": [
      "Роботу понравился грибочек с большой шляпкой, похожей на зонт. Вдоволь насмотревшись, он решил оставить гриб в стоящем тут ведре. Оно же натолкнуло нашего героя на мысль, что тут кто-то есть, а потому он поспешил уйти подальше в лес.",
      "Но буквально в нескольких метрах от грибной поляны робот обнаружил горящий костёр. Программа предписывает ему тушить огонь, если его никто не контролирует. Вокруг никого не было, а потому герой начал действовать."
    ]
  },
  {
    "LinkedContentID": "Story_L3_P5",
    "Articles": [
      "Будучи уверенным, что лесу ничего не угрожает, робот двинулся дальше. К тому моменту им был проделан довольно большой путь.",
      "Но дальнейшее продвижение было под вопросом, ибо перед героем возникла река. Моста, как и любой другой переправы, тут не было.",
      "Зато рядом лежали большие брёвна, и, быть может, кто-то собирался начать строить тут мост. Наш железный человек предпочёл решить эту задачу сейчас."
    ]
  },
  {
    "LinkedContentID": "Story_L3_P6",
    "Articles": [
      "Перекинув бревна через реку, робот стал аккуратно переходить по ним на другую сторону. Самое важное в тот момент было сохранить равновесие и не упасть, ибо течение было довольно сильным.",
      "Но всё прошло хорошо, и железный помощник двинулся дальше вдоль тропы.",
      "Однако чуть поодаль его ждала неприятная развилка. Вместо указателей стояли кучки камней, и что они значили, было совершенно неясно. Похоже, сейчас роботу предстояло сделать непростой выбор."
    ]
  },
  {
    "LinkedContentID": "Story_L3_P7",
    "Articles": [
      "Наш герой решил двинуться вправо, хотя ни один из вариантов ему не нравились - машине, которая привыкла жить чёткими алгоритмами, была неприятна полная неизвестность здешних маршрутов.",
      "Но тут робота ждало ещё одно разочарование - новое перепутье. Идущих далеко путей тут было меньше, но от этого не становилось легче. Придётся снова выбирать."
    ]
  },
  {
    "LinkedContentID": "Story_L3_P8",
    "Articles": [
      "И робот вновь выбрал себе путь. Куда он ведёт, он тоже не имел ни малейшего понятия.",
      "Тем не менее, любопытство железного помощника было слишком велико, чтобы сворачивать назад, поэтому он решил продолжить своё путешествие."
    ]
  }
]