[
  {
    "LinkedContentID": "Story_L8_P1",
    "Articles": [
      "Робот подошел к небольшой темной расщелине, уходящей далеко в глубину горного хребта. Кажется, это именно то место, о котором говорил его приятель, посылавший сигнал-SOS. Недолго думая, он зашел внутрь. Тьма окутала его со всех сторон, лишь небольшое количество света пробивалось из входа.",
      "Впереди виднелись едва различимые очертания какого-то уже давно заброшенного лагеря. Дальше в темноте двигаться было нельзя, а потому робот решил поискать хоть что-нибудь, что может испускать свет. На земле помимо камней, различных обломков и мусора валялись давно потухшие факела. Однако без огня от них не было никакого толку. ",
      "Механический путешественник продолжил поиски, и вскоре на ему на окуляры попался небольшой сундучок с кодовым замком.",
      "Осмотрев его и поднеся к свету из расщелины, робот заметил на дне записку: ”1.1^10 после запятой”. Судя по всему, эту загадку оставил владелец, чтобы не забыть код."
    ]
  },
  {
    "LinkedContentID": "Story_L8_P2",
    "Articles": [
      "Бинго! Подсказка оказалась верной, а в сундучке среди прочего хлама оказалось огниво и баночка со смолой для факела. Робот смазал факел вязкой субстанцией и пару раз высек над ним искры.",
      " Огонь вспыхнул, и путник начал постепенно продвигаться в глубь могучего хребта.",
      "Пещера оказалась отнюдь не маленькой: на пути то и дело попадались множества ответвлений и развилок, придавало уверенности лишь то, что все они были маленькими и выделялись на фоне основного тоннеля.",
      "Однако, дойдя до очередной развилки, робот уже не смог выбрать направление: уж слишком основная дорога стала похожа на второстепенные.",
      "В свете факела на каменных стенах виднелись различные каракули, какие-то числа и перечеркнутые слова. Кто-то явно провел здесь много времени, пытаясь найти верный путь. Робот заметил над проходами странные знаки. С помощью встроенного переводчика ему быстро удалось расшифровать их, оказывается, это была нумерация: 4, 231, 6, 8993, 720. На фоне различных надписей выделялся странный, написанный углем стишок, на привычном роботу языке: Да, много вариантов есть! Но верным будет номер 6! Неужели все так просто? Если это написал владелец сундука, то он наверняка снова прибегнул к математическим хитростям."
    ]
  },
  {
    "LinkedContentID": "Story_L8_P3",
    "Articles": [
      "Факториалом шести оказалось число 720, и робот решил проследовать по пути с этим номером.",
      "Вскоре тесный тоннель начал быстро расширяться, а затем сменился просторным длинным коридором, в конце которого виднелась металлическая решетка, перекрывающая путь дальше.",
      "Над ней виднелись цифры: 34. Неподалеку, на одной из стен был набор рычагов. Подойдя ближе, робот заметил, что первые четыре рычага были пронумерованы: 1, 1, 2, 3…, а остальные 6 - нет. Эта последовательность сразу показалась роботу знакомой: Возможно, это числа Фибоначчи - подумал он и решил вычислить остальные числа."
    ]
  },
  {
    "LinkedContentID": "Story_L8_P4",
    "Articles": [
      "Робот провел нужные вычисления и пронумеровал оставшиеся рычаги. Оказалось, что один из них имеет тот же номер, что и над дверью - 34. Потянув за него, робот увидел, как стальные прутья на проходе опускаются.",
      "Теперь путь открыт и робот уверенно зашагал дальше…",
      "И чуть было не упал в дыру, которая находилась прямо у него под ногами!",
      "Он поднял факел повыше: перед ним открылась просторная пещера с полом, выложенным каменными плитами, однако некоторые из них отсутствовали. Вместо них была бездонная пропасть, и свет огня никак не позволял оценить, что было там, внизу. Дальше двигаться не подумав - опасно, ведь неизвестно, какие плиты еще могут обвалиться. Робот заметил, что на каждой из них были высечены разные числа, а на самой первой было написано: “Испытание пройдет тот, кто простой путь найдет.” Что, если нужно наступать только на плиты, содержащие простые числа? Робот решил рискнуть и проверить свою гипотезу."
    ]
  },
  {
    "LinkedContentID": "Story_L8_P5",
    "Articles": [
      " Гипотеза оказалась верна: робот успешно прошел до противоположного конца пещеры. Впереди его ждал узенький скользкий проход. Оттуда веяло сыростью и роботу не очень хотелось туда спускаться, так как его детали могли заржаветь, но иного пути не было.",
      "Робот начал аккуратно спускаться вниз, и чем ниже он был, тем громче становилось какое-то журчание. Судя по всему, это была вода.",
      "Далее он попал в помещение, в центре которого было четыре небольших каменных пьедестала с чашами.  На потолке, прямо над ними были высечены слова на непонятном ему языке. Осмотревшись, он заметил ту самую журчащую воду, стекающую по стене и затопившую весь пол.",
      "Рядом лежала еще одна чаша, на дне которой было написано: ”Воду перелей туда, где смысла не лишаются слова”. Что бы это могло значить?",
      "Немного подумав, робот понял, о чем может идти речь: ведь на потолке высечены слова, и если налить воды в одну из чаш, то в отражении будет видно соответствующее слово. Однако, оно будет зеркально отражено и следовательно, потеряет весь смысл. Значит, нужно найти чашу, над которой находится слово-палиндром, читающееся с обеих сторон одинаково."
    ]
  },
  {
    "LinkedContentID": "Story_L8_P6",
    "Articles": [
      "Робот определил слово, набрал воды, далее налил ее в нужную чашу, и под действием силы тяжести, сосуд опустился вниз.",
      "Следом в стене напротив открылась лестница, ведущая куда-то наверх. Кажется, робот сделал все правильно и выход уже совсем скоро.",
      "По мере того, как он поднимался, света становилось все больше, стали доноситься знакомые звуки природы.",
      "Наконец, робот увидел лучи солнца, пробивающиеся сквозь небольшую арку. Это выход! Но путь опять преграждали железные прутья.",
      "На полу к нему была выложена дорожка из нажимных плит, они располагались в ряд, друг за другом.",
      "Робот не смог обнаружить никаких подсказок, оставалось лишь экспериментировать. Он решил наступить на первую плиту и увидел, как пруться немного опустились вниз. “Что-ж, кажется, все просто” - подумал он и наступил на следующую плиту, однако на этот раз ничего не произошло. Он отступил в сторону и встал на нее еще раз: прутья снова немного опустились. На следующую тоже понадобилось наступить два раза.",
      "Робот провел аналитические вычисления и выявил самую вероятную закономерность. Осталось точно рассчитать нужное количество нажатий на каждую плиту, ведь если ошибиться, неизвестно, что может произойти."
    ]
  },
  {
    "LinkedContentID": "Story_L8_P7",
    "Articles": [
      "Робот отправился дальше."
    ]
  }
]
