[
  {
    "LinkedContentID": "Story_L2_P1",
    "Articles": [
      "Робот отворил дверь и вышел во двор, в котором никогда до этого не бывал.",
      "Перед ним предстал удивительной красоты мир - без серых стен, с высокими деревьями, зелёной травой и чистым небом.",
      "Робот решил осмотреться, желая узнать больше о месте, которое было у него под носом.",
      "Пройдя несколько метров, он был уже со всех сторон окружён густым лесом, который, в то же время, создавал уют и спокойствие.",
      "Тут его привлекло что-то яркое в траве. Это были цветы. Прежде робот не видел, чтобы они росли так низко: все цветы в доме были в горшках на подоконниках.",
      "Желая посмотреть на них ближе, он подошёл, наклонился и принялся внимательно их рассматривать."
    ]
  },
  {
    "LinkedContentID": "Story_L2_P2",
    "Articles": [
      "Вдоволь налюбовавшись цветочками, робот хотел было идти дальше, но, повернув голову, он заметил что-то более необычное.",
      "Странные ножки со шляпками привлекли его внимание. Таких растений он раньше не видел, а потому захотел их внимательно изучить."
    ]
  },
  {
    "LinkedContentID": "Story_L2_P3",
    "Articles": [
      "Пройдя половину двора, вдруг робот остановился, повернув свою железную голову.",
      "Его привлекло нечто лежащее под деревьями. Там отчётливо угадывались силуэты ящиков, но что в них, было непонятно.",
      "Желая узнать, робот уверенно зашагал в их сторону...",
      "... и увидел лежащие в них яблоки! Всё стало понятно: хозяин дома собирал урожай с яблонь, но по какой-то причине не закончил работу. Возможно, некоторые ящики уже полны, и робот мог бы выполнить свою профессиональную задачу - отнести их ближе к дому."
    ]
  },
  {
    "LinkedContentID": "Story_L2_P4",
    "Articles": [
      "И правда - два ящика уже были достаточно полны, поэтому робот начал носить их к дому.",
      "Перетаскивая урожая, его не покидала радостная мысль, что и во дворе ему нашлось применение.",
      "Уже собравшись складывать яблоки в ящики побольше, робот, так же, как и его взгляд, вдруг замер.",
      "На больших контейнерах для фруктов были надписи, но состоящие лишь из нулей и единиц. Железному помощнику предстояло выяснить, куда ему следует положить спелые яблоки."
    ]
  },
  {
    "LinkedContentID": "Story_L2_P5",
    "Articles": [
      "Закончив работу, робот решил прогуляться в поисках нового дела, но оно не заставило себя ждать.",
      "Кажется, стоящее у тропы старое дерево рухнуло, перегородив дорогу.",
      "Робот поспешил в месту его нового задания.",
      "Дерево было довольно большим, но сил герою было не занимать. Нужно было лишь понять, как поступить с преградой."
    ]
  },
  {
    "LinkedContentID": "Story_L2_P6",
    "Articles": [
      "Недолго думая, железный помощник обхватил руками дерево, приподнял и, немного пройдя, положил вдоль тропы.",
      "Освободив дорогу, робот встал, чтобы посмотреть по сторонам. Тропа уходила далеко вперёд, а значит, мир вокруг намного больше, чем казалось ранее.",
      "Охваченный любопытством, робот решил пройтись дальше, но расстаться с домом было нелегко.",
      "Пообещав себе, что надолго в лесу не задержится, и попрощавшись с домом, робот двинулся в гущу леса, на встречу всему новому."
    ]
  }
]