[
  {
    "Articles": [
      "Soon after the start of its journey, the Robot began to increasingly see tall trees on both sides of the trail. It wandered into the thick of the forest.",
      "Fortunately (and at the same time unfortunately), the Robot stood at a crossroads. It became clear that it would not be lost here, but it was absolutely unclear where to go. The pointer in front of it could help solve this problem."
    ]
  },
  {
    "Articles": [
      "Our hero decided to turn right and moved on the clearly visible path further.",
      "Turning a little, it noticed something unusual a little at a distance and hurried there.",
      "A cart with logs, felled trees and an ax in the stump made it clear to him - this is a favorite place for lumberjacks. There was no one nearby, and therefore the Robot decided to help them in their difficult work. In the end, it was created to help others."
    ]
  },
  {
    "Articles": [
      "And now the work is over! Those who work here will definitely appreciate the help of an iron friend.",
      "However, there was nowhere to move on, and therefore the Robot had to return to the crossroads and go another way.",
      "At the next intersection, it wanted to turn to the right, but something attracted its attention.",
      "They were wild mushrooms. They were familiar to our hero, but here they grew in much larger numbers .\" What if you disrupt one of them ?\" it thought and began to choose the most interesting for itself."
    ]
  },
  {
    "Articles": [
      "The Robot liked the mushroom with a large umbrella-like hat. Having seen enough, it decided to leave the mushroom in a bucket standing here. It also prompted our hero to think that there was someone here, and therefore it hastened to go away into the forest.",
      "But just a few meters from the mushroom clearing, the Robot found a burning fire. The program instructs it to put out the fire if no one controls it. There was no one around, and therefore the hero began to act."
    ]
  },
  {
    "Articles": [
      "Confident that nothing threatens the forest, the Robot moved on. By that time, it had come quite a long way.",
      "But further progress was in question, for a river arose before the hero. There was no bridge, like any other crossing.",
      "But there were large logs nearby, and perhaps someone was going to start building a bridge here. Our Robot chose to solve this problem now."
    ]
  },
  {
    "Articles": [
      "Throwing logs across the river, the Robot began to carefully cross them to the other side. The most important thing at that moment was to maintain balance and not fall, because the current was quite strong.",
      "But everything went well, and the Robot moved further along the trail.",
      "However, an unpleasant fork awaited it a little further away. Instead of signs, there were piles of stones, and what they meant was completely unclear. It seems that now the Robot had to make a difficult choice."
    ]
  },
  {
    "Articles": [
      "Our hero decided to move to the right, although it did not like any of the options - the car, which was used to living with clear algorithms, was unpleasant the complete uncertainty of the routes here.",
      "But here the Robot was waiting for another disappointment - a new crossroads. There were fewer ways going far here, but this did not make it easier."
    ]
  },
  {
    "Articles": [
      "And the Robot again chose its path. Where it leads, it also had no clue.",
      "Nevertheless, the curiosity of the Robot was too great to turn back, so it decided to continue his journey."
    ]
  }
]