{
"Items": [
{
"Title": "The concept of code-style",
"Info": " Since you and I have already mastered some of the language constructs, and you can even try programming on your own, it would be right to tell you more about <color=green>code style</color> (code-style).\n In our In a time when programming was taking off, it's not enough just to write working code, it's also important that it's also <color=green>beautiful</color>, <color=green>concise</color> and <color=green>understandable</color > for other developers. Therefore, in the future we will talk not only about what can be used when writing code, but also how to do it in the best way.\n And we would like to start with <color=green>variable names</color> .",
"VideoTitles": ""
},
{
"Title": "Variable naming rules. Language",
"Info": "Let's start with the fact that all names must be in <color=green>English</color>. Moreover, it is not enough to write a word, but in English letters - it must be taken straight from the English language. If the translation into English causes if you're having trouble, feel free to use a translator. Your code should be understandable by anyone from anywhere in the world!",
"VideoTitles": "Vars Naming Rules Language"
},
{
"Title": "Variable naming rules. Symbols",
"Info": " The variable name must start with <color=green>small letter</color> and be written in the so-called <color=green>lower \"camel\"</color> style (in English lowerCamelCase ): all words in the name are written together and begin with a capital letter, except for the very first.",
"VideoTitles": "Vars Naming Rules Symbols"
},
{
"Title": "Variable naming rules. Words",
"Info": " A variable name can consist of one or more words. The main criterion here is <color=green>meaningfulness</color>: the name must clearly say what value the variable stores. That is why it is considered bad form to give names like a , b, cd, xyz, etc. However, the <color=red>too long</color> name is also bad, because it will also be difficult for the developer to understand.Therefore, one of the recommendations is not to use prepositions like of in names .\n Conclusion: try to give variables moderately long meaningful names so that your code and your intentions are clear to everyone!",
"VideoTitles": "Vars Naming Rules Words"
},
{
"Title": "Finally about code-style",
"Info": "Of course, these are not all the rules for writing good code. As we study new material, we will talk more than once about the best practices in programming!",
"VideoTitles": ""
}
]
}
