{
  "Items": [
    {
      "Title": "Понятие code-style",
      "Info": "     Поскольку мы с вами уже освоили некоторые конструкции языка, и вы даже можете пробовать программировать самостоятельно, будет правильным рассказать ещё и о <color=green>стиле кода</color> (code-style).\n     В наше время, когда программирование получило серьёзное развитие, мало просто писать рабочий код. Важно чтобы он также был <color=green>красивым</color>, <color=green>лаконичным</color> и <color=green>понятным</color> для других разработчиков. Поэтому в дальнейшем мы будем рассказывать не только о том, что можно использовать при написании кода, но и как это делать наилучшим образом.\n     И начать мы бы хотели с <color=green>названий переменных</color>.",
      "VideoTitles": ""
    },
    {
      "Title": "Правила наименования переменных. Язык",
      "Info": "     Начнём с того, что все названия должны быть на <color=green>английском</color> языке. Причём недостаточно написать слово, но английскими буквами - оно должно быть взято прямиком из английского языка. Если перевод на английский вызывает у вас трудности, не стесняйтесь пользоваться переводчиком. Ваш код должен быть понятен любому человеку из любой точки мира!",
      "VideoTitles": "Vars Naming Rules Language"
    },
    {
      "Title": "Правила наименования переменных. Символы",
      "Info": "     Имя переменной должно начинаться с <color=green>маленькой буквы</color> и быть записано в т.н. <color=green>нижнем \"верблюжьем\"</color> стиле (в англ. lowerCamelCase): все слова в имени пишутся слитно и начинаются с заглавной буквы, кроме самой первой.",
      "VideoTitles": "Vars Naming Rules Symbols"
    },
    {
      "Title": "Правила наименования переменных. Слова",
      "Info": "     Имя переменной может состоять из одного или нескольких слов. Здесь главный критерий - <color=green>осмысленность</color>: имя должно чётко говорить, что за значение хранит переменная. Именно поэтому считается дурным тоном давать имена вроде a, b, cd, xyz и т.д. Однако <color=red>слишком длинное</color> имя тоже плохо, т.к. оно также будет тяжело восприниматься разработчиком. Поэтому одна из рекомендаций - не использовать в именах предлоги навроде of.\n     Вывод: старайтесь давать переменным в меру длинные осмысленные имена, чтобы ваш код и ваши намерения были понятны каждому!",
      "VideoTitles": "Vars Naming Rules Words"
    },
    {
      "Title": "Напоследок про code-style",
      "Info": "     Разумеется, это далеко не все правила написания хорошего кода. По мере изучения нового материала мы ещё не раз будем говорить о лучших практиках в программировании!",
      "VideoTitles": ""
    }
  ]
}