{
  "Items": [
    {
      "Title": "Знакомство с C#. Инструкции, методы",
      "Info": "     Поздравляем, ты написал свою первую программу, которая работает! Но что вообще произошло? Почему мы написали то, что написали? Сейчас мы начнём знакомиться с <color=green>синтаксисом</color> языка и узнаем, что можно писать, как это писать, а главное - зачем.",
      "VideoTitles": ""
    },
    {
      "Title": "Структура программы",
      "Info": "     Окинем взором структуру программы, когда мы только создали <color=green>проект</color> приложения на C#. Видно, что стартовый шаблон довольно сложен, здесь много разных слов, скобочек и т.д. Всё это, разумеется, имеет смысл, но он станет понятен лишь позже, когда мы наберёмся опыта.\n     В наших программах весь пока не интересный нам код будет спрятан, но если вы чрезвычайно любопытны, то можете найти в Интернете <color=green>документацию</color> по C# и изучить его самостоятельно.",
      "VideoTitles": "C# Program Review"
    },
    {
      "Title": "Инструкции и методы",
      "Info": "     Наши первые программы будут ограничены одним <color=green>методом</color>. Методами в C# называют функции, которые есть и в других языках и выполняют набор записанных в них <color=green>инструкций</color>. Инструкции, в свою очередь, представляют собой различные команды, будь то сложить два числа, умножить их или <color=green>вызвать</color> другой метод, т.е. заставить выполниться другой набор инструкций. Каждая инструкция обязательно заканчивается точкой с запятой.\n Все программы на C# начинают выполняться с метода Main, это <color=green>точка входа</color> в программу. Мы же будем писать вспомогательные методы, которые будут вызываться в том числе и из Main.",
      "VideoTitles": ""
    },
    {
      "Title": "Аргументы метода",
      "Info": "     Вы могли заметить, что при вызове метода в прошлой задаче вы писали пустые скобочки? Зачем они нужны?\n     В скобочках методу можно передать <color=green>аргументы</color> - некоторые данные, которые могут быть использованы в инструкциях этого метода. Поскольку в прошлой задаче методу не нужны были никакие аргументы, мы оставили их <color=green>пустыми</color>.\n",
      "VideoTitles": ""
    },
    {
      "Title": "Методы с аргументами. Консоль",
      "Info": "     Сейчас потренируемся вызывать <color=green>методы с аргументами</color>. Для этого напишем, без малого, иконическую программу вывода на <color=green>консоль</color> фразы \"Hello, world!\".\n     <color=green>Консоль</color> - это, по сути, окно, в котором пользователь может взаимодействовать с программой, передавать ей данные или получать их. В С# можно вызвать методы консоли, написав Console., а затем имя какого-то метода. К сожалению, наш планшет не поддерживает работу с более чем одним окном, поэтому вывод фразы будет несколько <color=yellow>условным</color> - консоли мы не увидим, но зато поупражняемся в программировании!)",
      "VideoTitles": "Console Review"
    }
  ]
}