{
  "Items": [
    {
      "Title": "Сокращённые операции",
      "Info": "     Мы с вами освоили арифметику в C#, и это хорошо! Но есть проблема: иногда может возникнуть необходимость, например, к уже инициализированной переменной прибавить какое-то число. Такая инструкция будет довольно <color=red>длинной</color> из-за того, что в ней <color=red>дублируется</color> имя переменной, что не есть хорошо.",
      "VideoTitles": "Too Long Addition"
    },
    {
      "Title": "Сокращённые операции",
      "Info": "     Но есть способ сделать это элегантнее - с помощью <color=green>сокращённых</color> арифметических операций. Например, можно использовать оператор <color=green>+=</color> и, таким образом, прибавить к переменной некоторое число. Аналогичным образом работают и похожие операторы для вычитания (<color=green>-=</color>), умножения (<color=green>*=</color>) и деления (<color=green>/=</color>).",
      "VideoTitles": "Shortened Operations"
    },
    {
      "Title": "Инкремент и декремент",
      "Info": "     А в случае, если нам надо прибавить или вычесть из переменной единицу, есть способ ещё круче - использовать операторы <color=green>инкремента</color> (<color=green>++</color>) или <color=green>декремента</color> (<color=green>--</color>). И хотя использовать их очень просто, есть некоторые нюансы.",
      "VideoTitles": "Increment Usage"
    },
    {
      "Title": "Префиксный и постфиксный операторы",
      "Info": "     Есть два способа применить инкремент и декремент - написать его <color=green>перед переменной</color> или <color=green>после неё</color>. Это не влияет на результат, который окажется в переменной, но влияет на <color=green>порядок выполнения</color> программы в некоторых случаях. Например, передавая в метод переменную с инкрементом, возможны два сценария:\n     1) Если инкремент <color=green>префиксный</color>, сначала переменная увеличит своё значение, потом она будет передана в метод;\n     2) Если инкремент <color=green>постфиксный</color>, сначала переменная будет передана со старым значением, потом сработает инкремент.\n     Вывод: при использовании ++ или -- <color=green>будьте аккуратны</color>!",
      "VideoTitles": "Nuances of Increment"
    }
  ]
}