{
  "Items": [
    {
      "Title": "Типы данных. Переменные",
      "Info": "     Отлично! Мы с вами успешно вызвали метод с аргументом. Пришло время разобраться с тем, что мы передавали как аргумент - данными, вернее, <color=green>типами данных</color>, и тем, где они хранятся - <color=green>переменными</color>",
      "VideoTitles": ""
    },
    {
      "Title": "Переменные",
      "Info": "     Вообще, любая <color=green>переменная</color> - это некоторая <color=green>именованная</color>область в памяти компьютера, которая хранит данные по некоторому адресу. Поскольку она именованная, с помощью имени мы и можем обратиться к этому участку памяти и получить нужные данные.\n     К слову, данные бывают разных типов.",
      "VideoTitles": ""
    },
    {
      "Title": "Типы данных. Объявление переменной",
      "Info": "     <color=green>Типы данных</color> бывают разные, в зависимости от того, что мы хотим хранить в переменной - число, строку, объект или что-то ещё. Пока что познакомимся с <color=green>целочисленным</color> типом - <color=green>int</color>, хранящем целые числа (как положительные, так и отрицательные) из некоторого диапазона.\n     Чтобы <color=green>объявить</color> переменную (т.е. присвоить некоторой ячейке памяти имя), нужно указать тип данных, а затем, через пробел, имя переменной.",
      "VideoTitles": "Variables Declaration"
    },
    {
      "Title": "Присвоение значения переменной",
      "Info": "     Мы объявили переменную, но пока что она бесполезна - в ней просто ничего не хранится. Необходимо <color=green>присвоить</color> ей некое <color=green>значение</color>, которое мы сохраним в памяти. Для этого в следующей строке после объявления переменной нужно указать её имя, поставить <color=green>оператор присваивания</color> = и написать значение, соответствующее типу этой переменной.",
      "VideoTitles": "Variables Definition"
    },
    {
      "Title": "Инициализация переменной",
      "Info": "     Теперь мы знаем, как объявить переменную и присвоить её значение, но на это каждый раз требуется две строки кода. Было бы здорово выполнять эти операции <color=green>одновременно</color>...\n     И так можно сделать! Присвоение значения переменной при её объявлении называется <color=green>инициализацией</color> и выполняется она следующим образом: объявляется переменная и сразу после имени идёт оператор = и значение.\n     Теперь можно попрактиковаться! Хотя... есть ещё кое-что  важное!",
      "VideoTitles": "Variables Initialization"
    },
    {
      "Title": "Комментарии",
      "Info": "     В некоторых задачах и наших видео вы могли заметить <color=green>зелёные слова</color> после <color=green>двойного слеша</color>. Это <color=green>комментарии</color>, с их помощью можно оставлять пометки по коду, чтобы другим разработчикам было проще разобраться. Или например, если нужно убрать код из программы, но не стирать его, то можно поставить перед ним двойной слеш. Либо (если текст многострочный) обрамить его символами <color=green>/*</color> и <color=green>*/</color>.",
      "VideoTitles": "Commentaries"
    }
  ]
}