{
  "Items": [
    {
      "Script": "Наконец, долгая партия подошла к концу - робот одержал победу, но кое-что для него всё ещё оставалось загадкой: против кого же он играл? Пока он пытался найти ответ на этот вопрос, оставшиеся фигуры медленно и равномерно опускались обратно вниз, под шахматное поле. Вскоре в зале воцарилась полная тишина."
    },
    {
      "Script": "Путешественник решил, наконец, получше рассмотреть того, находился на троне. Он аккуратно поднялся по ступеням и подошел ближе: это был очень старый и невероятно искусно сконструированный робот. На его корпусе были видны открытые детали, шестерёнки, различные трубки, которые должны были приводить его в движение. Он был создан еще задолго до цифровой эпохи и, кажется, работает от какого-то заводного механизма."
    },
    {
      "Script": "Посмотрев по сторонам, робот заметил в небольших арках, вырезанных в стене еще несколько подобных древних изделий. Они были выполнены чуть грубее и примитивнее, и каждое из них держало в руках меч. Судя по всему, это были стражи, которым предназначалось охранять это место."
    },
    {
      "Script": "Путешественник вернул свой взгляд на робота, сидевшего на троне. У него не было оружия, однако в его правой ладони находился странный предмет кубической формы, имеющий примерно то же происхождение, что и его владелец: он был похож на какой-то механический артефакт или очень сложную конструкцию с кучей шестерней и подвижных деталей, являющуюся частью чего-то еще более сложного. Робот протянул руку к кубу."
    },
    {
      "Script": "Не успел он до него дотронуться, как вдруг, сбоку раздался металлический грохот. Путешественник вздрогнул и обернулся в сторону шума: двое стражей направлялись прямо к нему. Их движения были резкими и уверенными."
    },
    {
      "Script": "Один из них сразу начал постепенно замедляться, пока в конце концов полностью не остановился, другой же продолжал наступать. Робот сделал пару шагов назад, но страж быстро сблизился с ним и начал наносить один удар за другим."
    },
    {
      "Script": "Путешественник только успевал уклоняться и отходить всё дальше и дальше. Судя по тому, что активировались всего два стража, а один из них довольно быстро замер, роботу нужно было лишь продержаться некоторое время, пока заводной механизм последнего полностью не остановится."
    }
  ]
}
