{
  "Items": [
    {
      "Script": "Заводной механизм стража с каждой секундой тикал все реже и реже, пока, наконец, полностью не умолк. Робот осторожно подошел к нему и ткнул пару раз в корпус. Страж лишь немного покачался."
    },
    {
      "Script": "Удостоверившись, что опасность миновала, путешественник поднялся по ступеням еще раз посмотреть на загадочный артефакт. Он взял его и покрутил в руках: куб оказался довольно увесистым для своих размеров. Всё его множество разных деталей были сделаны из металла, по цвету напоминающего золото или медь. Кажется, он когда-то ярко блестел на свету, переливаясь жёлтыми бликами, но давно утратил эту черту из-за рабочих царапин и потертостей."
    },
    {
      "Script": "“Это должно куда-то подходить…” - подумал путешественник и начал искать, для чего этот предмет мог быть предназначен. Обойдя весь зал вдоль и поперек, он так и не нашел ему подходящего места и тогда решил положить изделие обратно"
    },
    {
      "Script": "Вновь поднявшись по ступеням, он подошел к неподвижному древнему роботу, и возвращая артефакт ему в ладонь, заметил сквозь пальцы его правой руки какое-то углубление в подлокотнике трона. Он отодвинул руку и увидел квадратное отверстие, на внутренних стенках которого находились шестеренчатые механизмы, такие же, как и на гранях куба снаружи. Всё выглядело так, как будто они должны соединяться друг с другом и работать вместе."
    },
    {
      "Script": "Робот поместил артефакт в углубление, немного подвигал его из стороны в сторону, и шестерни состыковались. После он попробовал покрутил один из дисков на верхней грани куба: все детали пришли в движение, издавая характерный звук, уходящий куда-то далеко вниз, и из под пола начали подниматься уже знакомые роботу шахматные фигуры."
    },
    {
      "Script": "Он поспешно повернул диск в обратном направлении, при этом случайно задев еще один, находившийся рядом. После этого фигуры опустились обратно, и следом в стене напротив приоткрылась дверь, ведущая в другие помещения. Раньше робот её даже не замечал: настолько сильно она сливалась с окружением. Похоже, куб является своего рода ключом, с помощью которого можно управлять этим механическим зáмком, и теперь робот является его обладателем. Неизвестно, что стало с предыдущим владельцем, посмертно сидящем на троне, но судя по всему, его правление закончилось неудачно и уже очень давно. Робот подумал, что для начала, ему стоит разобраться, как открыть центральные ворота, ведь они по прежнему были заперты. Однако, действовать наугад, повернув все диски сразу, было неразумно: под контролем этого ключа могло находиться всё, что угодно, в том числе и активация стражей. В механизме управления определенно должна была быть какая-то закономерность, поэтому робот решил детально изучить ее."
    }
  ]
}
