{
  "Items": [
    {
      "Script": "Толстые шестерни в стенах за́мка начали работать, издавая тяжелый металлический звук, и вместе с этим двери медленно открывались в стороны. Робот протиснулся внутрь и попал в большой тронный зал."
    },
    {
      "Script": "Он оказался в белом просторном помещении с бесконечно высокими потолками, наполненном светом из множества окон. Подобно площади, оно было пустое и чистое: в нем отсутствовали яркие украшения, позолоченные элементы и знамена. Единственным, что сразу бросалось в глаза на фоне всего остального, было черно-белое поле на полу, прямо по центру, напоминающее шахматную доску. В самом конце зала располагалась широкая пирамида, на последней ступени которой на небольшом каменном троне сидел робот с опущенной вниз головой. Судя по-всему, он уже давно не включался. Вопросов становилось только больше."
    },
    {
      "Script": "Путешественник сделал пару шагов от входа вперед и услышал громкий хлопок, за которым последовало долгое раскатистое эхо. Он резко обернулся - дверь была закрыта."
    },
    {
      "Script": "Понимая, что назад дороги нет, робот решил пройти дальше и осмотреться. Вскоре он заметил, что здесь не было ни одной двери, ни одного прохода в другие помещения, что странно, учитывая размеры замка. Предметы быта и убранства в замке также отсутствовали."
    },
    {
      "Script": "Возле черно-белой сетки на полу робот увидел на стойке небольшую панель, похожую на какое-то древнее механическое устройство. Он подошел ближе и нажал на центральную кнопку."
    },
    {
      "Script": "Прямо у него под ногами загудели какие-то механизмы, и через пару секунд из под пола начали медленно подниматься шахматные фигуры. Размеры этих статуй были внушительными, некоторые даже превышали рост робота. Похоже, это и вправду было игровое поле. Робот нажал на другую кнопку: механизмы где-то в глубине снова начали свою работу, и одна из шахматных фигур с его стороны сдвинулась на соседнюю клетку. Через пару мгновений статуя с противоположного конца переместилась в ответ."
    },
    {
      "Script": "Путешественник решил принять участие в этой игровой партии королевских масштабов."
    }
  ]
}
