{
  "Items": [
    {
      "Script": "The guardian's clockwork ticked less and less every second, until it finally stopped completely. The robot cautiously approached it and jabbed a couple of times in the body. The guard only wobbled a little."
    },
    {
      "Script": "Convinced that the danger had passed, the traveler went up the stairs to look at the mysterious artifact once again. He took it and turned it in his hands: the cube turned out to be quite weighty for its size. All its many different parts were made of metal, in color reminiscent of gold or copper. It seems that it once shone brightly in the light, shimmering with yellow highlights, but has long lost this feature due to working scratches and scuffs."
    },
    {
      "Script": "“It must fit somewhere…” - the traveler thought and began to look for what this item could be intended for. Walking around the entire hall up and down, he did not find a suitable place for it and then decided to put the item back "
    },
    {
      "Script": "Climbing the steps again, he approached the motionless ancient robot, and returning the artifact to his palm, noticed through the fingers of his right hand some kind of depression in the armrest of the throne. He moved his hand away and saw a square hole, on the inner walls of which there were gear mechanisms, the same as on the sides of the cube outside. Everything looked like they should connect with each other and work together. "
    },
    {
      "Script": "The robot placed the artifact in a recess, moved it a little from side to side, and the gears joined. After that, he tried to spin one of the disks on the top face of the cube: all the details began to move, making a characteristic sound that goes somewhere far away down, and chess pieces already familiar to the robot began to rise from under the floor."
    },
    {
      "Script": "He hurriedly turned the disk in the opposite direction, accidentally hitting another one nearby. After that, the figures descended back, and then a door leading to other rooms opened slightly in the wall opposite. Previously, the robot did not even notice it: so it blended very well with the surroundings.It seems that the cube is a kind of key with which you can control this mechanical lock, and now the robot is its owner.It is not known what happened to the previous owner, sitting on the throne posthumously, but apparently, his reign The robot thought that for a start, it should figure out how to open the central gate, because it was still locked.However, acting at random, turning all the disks at once, was unwise: under the control of this key could be anything, including the activation of the guards. There must definitely be some kind of pattern in the control mechanism, so the robot decided to study it in detail. "
    }
  ]
}