{
  "Items": [
    {
      "Script": "Finally, the long game came to an end - the robot won, but something was still a mystery to him: who was he playing against? While he was trying to find the answer to this question, the remaining pieces slowly and evenly fell back down, under the chess field. Soon, complete silence reigned in the hall."
    },
    {
      "Script": "The traveler finally decided to get a better look at the one on the throne. He carefully climbed the steps and came closer: it was a very old and incredibly skillfully designed robot. Its body showed exposed parts, gears, various tubes, which were supposed to power it. It was created long before the digital age and seems to be powered by some kind of winding mechanism."
    },
    {
      "Script": "Looking around, the robot noticed several similar ancient objects in small arches carved into the wall. They were made a little rougher and more primitive, and each of them held a sword in their hands. Apparently, these were the guards who was meant to guard this place."
    },
    {
      "Script": "The Traveler returned his gaze to the robot seated on the throne. He had no weapon, but in his right palm was a strange cube-shaped object, similar in origin to its owner: it looked like some kind of either a mechanical artifact or a very complex structure with a bunch of gears and moving parts, which is part of something even more complex. The robot extended its hand to the cube."
    },
    {
      "Script": "Before he touched it, suddenly, a metallic rumble sounded from the side. The traveler shuddered and turned in the direction of the noise: two guards were heading straight for him. Their movements were sharp and confident."
    },
    {
      "Script": "One of them immediately began to gradually slow down until it finally stopped completely, while the other continued to advance. The robot took a couple of steps back, but the guard quickly approached him and began to strike one after another."
    },
    {
      "Script": "The traveler only had time to dodge and move further and further away. Judging by the fact that only two guardians activated, and one of them froze rather quickly, the robot only needed to hold out for a while until the winding mechanism of the latter completely stopped. "
    }
  ]
}