{
  "Items": [
    {
      "Script": "The stone hit the target and knocked out the damaged link. The whole structure was dragged down, the second chain, unable to withstand the load, also gave slack, the bridge collapsed across the moat with a crash."
    },
    {
      "Script": "The robot walked over it through an archway and into a vast clear area."
    },
    {
      "Script": "It was quiet here, completely deserted and empty. The wind drove dry leaves over the cold stone, and besides them, only a couple of long-dead trees stood out against the white background."
    },
    {
      "Script": "The traveler walked past empty flower beds and dry fountains, looking around warily."
    },
    {
      "Script": "Then he quickened his pace, wanting to get out of this uncomfortable open space as soon as possible, and did not notice how he ran into a white wall. He moved away to completely cover it with his eyes."
    },
    {
      "Script": "These were two massive doors of great height - the robot went right up to the main gate of the castle."
    },
    {
      "Script": "He tried to pull the handles, but the doors didn't budge or even make a sound."
    },
    {
      "Script": "Thinking about it, the robot heard a strange monotonous ticking and decided to check where it came from. On the side of the right door, on the wall, he saw a mechanical device that looked like a combination drum lock, but there was something unusual in it for products of this kind: the rings, which are supposed to be turned by hand, moved by themselves with small pauses, making characteristic clicks."
    },
    {
      "Script": "The robot came closer and looked closely at the engraving on the rings: each of them was inscribed with something resembling mathematical brackets. A little to the right of the lock was a small button with the image of a circle divided vertically. The robot assumed that these halves of the circle in the figure are quite could symbolize paired brackets ... "
    }
  ]
}