{
  "Items": [
    {
      "Script": "Thick gears in the castle walls began to work, making a heavy metallic sound, and with it, the doors slowly opened to the sides. The robot squeezed inside and entered the large throne room."
    },
    {
      "Script": "He found himself in a white spacious room with infinitely high ceilings, filled with light from many windows. Like a square, it was empty and clean: it lacked bright decorations, gilded elements and banners. The only thing that immediately caught the eye on against the background of everything else, there was a black and white field on the floor, right in the center, resembling a chessboard.At the very end of the hall was a wide pyramid, on the last step of which a robot sat on a small stone throne with its head down. I didn't turn it on for a long time. There were only more questions."
    },
    {
      "Script": "The traveler took a couple of steps forward from the entrance and heard a loud bang followed by a long rolling echo. He turned around sharply - the door was closed."
    },
    {
      "Script": "Realizing that there is no way back, the robot decided to go further and look around. Soon he noticed that there was not a single door here, not a single passage to other rooms, which is strange, given the size of the castle. Household items and decorations in the castle was also missing."
    },
    {
      "Script": "Near the black-and-white grid on the floor, the robot saw a small panel on a counter that looked like some ancient mechanical device. It moved closer and pressed the center button."
    },
    {
      "Script": "Right under his feet, some mechanisms hummed, and after a couple of seconds, chess pieces began to slowly rise from under the floor. The size of these statues was impressive, some even exceeded the height of a robot. It looked like it really was a playing field. The robot pressed another button: the mechanisms somewhere in the depths began their work again, and one of the chess pieces from its side moved to the adjacent cell. After a couple of moments, the statue from the opposite end moved in response."
    },
    {
      "Script": "The traveler has decided to take part in this game of royal proportions."
    }
  ]
}
