[
  {
    "Articles": [
      "В один обычный день в большом и уединённом доме посреди леса очнулся наш герой - человекоподобный робот-помощник. Каждое утро он включается, чтобы помогать живущим здесь людям по дому - делать уборку и выполнять разные поручения.",
      "Сейчас в детской никого не было, поэтому он решил прибраться на столе, где лежало куча разных вещей."
    ]
  },
  {
    "Articles": [
      "Разложив вещи по местам, робот направился в другой конец комнаты, где стоял ещё один стол.",
      "Здесь было достаточно чисто, но железного помощника привлекло другое. Один из домочадцев, очевидно, решил изучить программирование и написал небольшую программу. Она осталась открытой, и робот, движимый своим любопытством, решил её запустить."
    ]
  },
  {
    "Articles": [
      "Все дела в этой комнате были сделаны, и наш герой вышел в коридор.",
      "Перед детской была дверь на кухню. Там робота также ждала работа, а потому он подошёл к плотно закрытой двери, чтобы отворить её."
    ]
  },
  {
    "Articles": [
      "Увидев холодильник, программа робота выбрала новую задачу для выполнения - накормить рыбок, что живут в аквариуме в коридоре. Корм лежал в отдельном отсеке, и робот принялся искать его."
    ]
  },
  {
    "Articles": [
      "Взяв корм, наш герой вышел в коридор и направился к аквариуму.",
      "Все рыбки, завидев двухметрового робота, попрятались в камнях и водорослях. Но конечно, робот не хотел им навредить, а лишь подсыпать им корма. В то же время, он принялся подсчитывать, на сколько дней осталось пропитания."
    ]
  },
  {
    "Articles": [
      "Задача была выполнена, на кухне робота ждало ещё одно поручение.",
      "Семья собиралась вечером испечь пирог с яблоками и пиццу. Надо было замесить тесто, благо всех ингредиентов было в достатке."
    ]
  },
  {
    "Articles": [
      "Уже многие поручения выполнены, однако некоторые ещё ждут нашего героя впереди.",
      "Робот прошёлся до другого конца коридора и свернул в ванную. Сразу два поручения стали активны в его программе - набрать воды в ведро, чтобы помыть пол, а также набрать воды (но уже горячей) в ванну, дабы дети могли искупаться."
    ]
  },
  {
    "Articles": [
      "Все дела в ванной были выполнены, и робот поспешил покинуть эту комнату.",
      "Осталось лишь одно поручение, оно ждало нашего героя в родительской спальне.",
      "Хозяин дома потерял очки и попросил робота их поискать. Возможно, он случайно оставил их в сейфе, когда перекладывал вещи в нём. Робот принялся за работу."
    ]
  },
  {
    "Articles": [
      "В сейфе ничего не нашлось, и робот двинулся на первый этаж сообщить хозяину об этом. В доме сейчас никого не было, но дверь на улицу была чуть приоткрыта. Её всегда держали закрытой, чтобы робот случайно никуда не ушёл, но сейчас ему ничто не мешало покинуть дом. Наш герой вышел на улицу."
    ]
  }
]