{
  "Items": [
    {
      "ID": 1,
      "Title": "Fix pointer",
      "Description": "You need to declare a string type variable with the value left and return this variable",
      "StartCode": "public string FixNames()\n{\n \n \n}\n"
    },
    {
      "ID": 2,
      "Title": "Line length",
      "Description": "A string is passed to the input, you need to return its length",
      "StartCode": "public int GetLength(string str)\n{\n \n \n}\n"
    },
    {
      "ID": 3,
      "Title": "Uppercase",
      "Description": "You need to return a string containing only uppercase characters from the original string",
      "StartCode": "public string GetUpperLetters(string str)\n{\n \n \n}\n"
    },
    {
      "ID": 4,
      "Title": "Reliable Path",
      "Description": "Need to find a trusted path. Paths are represented as strings passed in an array. A trusted path is one in which all characters are in uppercase. The index of the trusted path must be returned.",
      "StartCode": "public int GetRightWay(string[] ways)\n{\n \n \n}\n"
    },
    {
      "ID": 5,
      "Title": "Decode Text",
      "Description": "You need to decode the text. To do this, you need to take all the words starting with a capital letter from the source text and put them in the resulting array in reverse order.",
      "StartCode": "public string[] GetDecodedText(string[] text)\n{\n \n \n}\n"
    },
    {
      "ID": 6,
      "Title": "Crooked division",
      "Description": "The program split the text incorrectly. You have to fix it. To do this, you need to put the text together and separate it using delimiters: +, -, *, /",
      "StartCode": "public string[] FixArray(string[] array)\n{\n \n \n}\n"
    },
    {
      "ID": 7,
      "Title": "Clear Path Matrix",
      "Description": "You need to fix the path matrices that were corrupted during a program failure. It is known that in the maritza the path is indicated by binary characters, as well as the start and end points of the path ([S], [F]), therefore all other characters are needed replace with 0.",
      "StartCode": " private string[] FixPathMatrix(string[] matrix)\n{\n \n \n}\n"
    }
  ]
}