[
  {
    "Articles": [
      "The robot came to a small dark crevice that goes far into the depths of the mountain range. It seems that this is exactly the place that his friend was talking about when he sent the SOS signal. Without thinking twice, he went inside. Darkness enveloped him from all sides , only a small amount of light was coming from the entrance.",
      "Ahead, there were barely visible outlines of some long-abandoned camp. It was impossible to move further in the darkness, and therefore the robot decided to look for at least something that could emit light. On the ground, in addition to stones, various debris and debris, there were long-extinguished torches. However, without fire, they were of no use. ",
      "The mechanical traveler continued his search, and soon found a small chest with a combination lock on his eyepieces.",
      "After examining it and holding it up to the light from the crevice, the robot noticed a note at the bottom: ”1.1^10 after the decimal point”. Apparently, the owner left this riddle so as not to forget the code."
    ]
  },
  {
    "Articles": [
      "Bingo! The hint turned out to be correct, and in the chest, among other things, there was a flint and a jar of resin for the torch. The robot smeared the torch with a viscous substance and struck sparks over it a couple of times.",
      "The fire broke out, and the traveler began to gradually move deep into the mighty ridge.",
      "The cave turned out to be by no means small: there were many branches and forks along the way, the only thing that gave confidence was that they were all small and stood out against the background of the main tunnel.",
      "However, having reached the next fork, the robot could no longer choose a direction: the main road became too much like secondary ones.",
      "In the light of the torch, various scribbles, some numbers and crossed out words were visible on the stone walls. Someone obviously spent a lot of time here trying to find the right path. The robot noticed strange signs above the passages. With the help of a built-in translator, he quickly managed to decipher them, it turns out that it was the numbering: 4, 231, 6, 8993, 720. Against the background of various inscriptions, a strange charcoal poem stood out, in the language familiar to the robot: Yes, there are many options! But the number 6 will be correct! so simple? If the owner of the chest wrote this, then he must have resorted to mathematical tricks again."
    ]
  },
  {
    "Articles": [
      "The factorial of six turned out to be 720, and the robot decided to follow the path with that number.",
      "Soon, the cramped tunnel began to expand rapidly, and then gave way to a spacious long corridor, at the end of which a metal grate was visible, blocking the path further.",
      "Above it were the numbers: 34. Nearby, on one of the walls, there was a set of levers. Moving closer, the robot noticed that the first four levers were numbered: 1, 1, 2, 3 ..., and the remaining 6 were not. This sequence immediately seemed familiar to the robot: Perhaps these are Fibonacci numbers - he thought and decided to calculate the rest of the numbers."
    ]
  },
  {
    "Articles": [
      "The robot did the necessary calculations and numbered the remaining levers. It turned out that one of them has the same number as above the door - 34. Pulling on it, the robot saw how the steel bars in the passage were lowered.",
      "Now the path is open and the robot has confidently moved on...",
      "He nearly fell into the hole right under his feet!",
      "He raised the torch higher: a spacious cave opened before him with a floor paved with stone slabs, but some of them were missing. Instead, there was a bottomless abyss, and the light of the fire did not allow one to assess what was down there. without thinking - dangerous, because it is not known which plates can still collapse. The robot noticed that different numbers were carved on each of them, and on the very first it was written: “The test will pass the one who finds a simple way.” What if you only need to step on tiles containing prime numbers? The robot decided to take a chance and test his hypothesis."
    ]
  },
  {
    "Articles": [
      "The hypothesis turned out to be correct: the robot successfully passed to the opposite end of the cave. There was a narrow slippery passage ahead of it. It smelled damp from there and the robot did not really want to go down there, since its parts could rust, but there was no other way.",
      "The robot began to gently descend, and the lower it was, the louder some kind of murmur became. Apparently, it was water.",
      "Then he got into a room, in the center of which there were four small stone pedestals with bowls. On the ceiling, right above them, words were carved in a language he did not understand. Looking around, he noticed the same murmuring water flowing down the wall and flooding the whole floor.",
      "Nearby lay another bowl, on the bottom of which was written: 'Pour the water where the words do not lose their meaning.' What could that mean?",
      "after a little thought, the robot realized what it could be about: after all, words are carved on the ceiling, and if you pour water into one of the bowls, then the corresponding word will be visible in the reflection. However, it will be mirrored and therefore lose the whole point. So, you need to find a bowl, over which there is a palindrome word that reads the same on both sides. "
    ]
  },
  {
    "Articles": [
      "The robot determined the word, drew water, then poured it into the right bowl, and under the influence of gravity, the vessel fell down.",
      "Next, a staircase opened in the wall opposite, leading somewhere upstairs. It seems that the robot did everything right and the exit will be very soon.",
      "As it rose, the light increased, and the familiar sounds of nature began to come up.",
      "Finally, the robot saw the rays of the sun breaking through a small archway. This is the way out! But the iron bars blocked the path again.",
      "There was a path of pressure plates on the floor leading to it, one after the other in a row.",
      "The robot couldn't find any clues, all that was left to do was to experiment. He decided to step on the first slab and saw the rods go down a bit. Well, it seems simple, he thought, and stepped on the next slab, but this time nothing happened. He stepped aside and stood on it again: the bars again lowered a little. The next one also had to be stepped on twice.",
      "The robot did an analytical calculation and found the most likely pattern. It remains to accurately calculate the required number of clicks on each plate, because if you make a mistake, you don't know what can happen."
    ]
  },
  {
    "Articles": [
      "The robot moved on."
    ]
  }
]