[
  {
    "LinkedContentID": "Story_L2_P1",
    "Articles": [
      "The Robot opened the door and went out into the courtyard, which it had never been to before.",
      "Before its appeared an amazing beauty world - without gray walls, and with tall trees, green grass and clean skies.",
      "The Robot decided to look around, wanting to know more about the place it had under his nose.",
      "Having passed several meters, it was already surrounded on all sides by a dense forest, which, at the same time, created comfort and tranquility.",
      "It was attracted to something bright in the grass here. It was flowers. Previously, the Robot did not see them grow so low: all the flowers in the house were in pots on the windowsills.",
      "Wanting to look at them closer, it came up, leaned in and began to carefully consider them."
    ]
  },
  {
    "LinkedContentID": "Story_L2_P2",
    "Articles": [
      "Having loved the flowers, the Robot wanted to go further, but, turning its head, it noticed something more unusual.",
      "Strange legs with hats caught its attention. It had not seen such plants before, and therefore wanted to carefully study them."
    ]
  },
  {
    "LinkedContentID": "Story_L2_P3",
    "Articles": [
      "After walking half the yard, suddenly the Robot stopped, turning its iron head.",
      "It was attracted to something lying under the trees. The silhouettes of the boxes were clearly guessed there, but what was in them was not clear.",
      "Wanting to find out, the Robot confidently walked in their direction...",
      "... and saw the apples lying in them! Everything became clear: the owner of the house harvested from apple trees, but for some reason did not finish the work. Perhaps some boxes are already full, and the Robot can complete its professional task of taking them closer to home."
    ]
  },
  {
    "LinkedContentID": "Story_L2_P4",
    "Articles": [
      "And true - two boxes were already quite full, so the Robot began to carry them to the house.",
      "Dragging the harvest, the Robot did not leave the joyful thought that it found application in the yard.",
      "Having already gathered to put apples in larger boxes, the Robot, just like its look, suddenly froze.",
      "There were inscriptions on large fruit containers, but consisting of only zeros and ones. The Robot had to find out where it should put ripe apples."
    ]
  },
  {
    "LinkedContentID": "Story_L2_P5",
    "Articles": [
      "After finishing work, the Robot decided to take a walk in search of a new business, but it was not long in coming.",
      "The old tree was standing in the tropics, blocking the road.",
      "The Robot hurried to the site of his new assignment.",
      "The tree was quite large, but the hero did not take the strength. It was only necessary to understand how to deal with the barrier."
    ]
  },
  {
    "LinkedContentID": "Story_L2_P6",
    "Articles": [
      "Without thinking for long, the Robot grabbed a tree with his hands, lifted it up and, having passed a little, laid it along the trail.",
      "After clearing the road, the Robot stood up to look around. The path went far ahead, which means that the world around is much larger than it seemed before.",
      "Overcome with curiosity, the Robot decided to walk further, but it was not easy to part with the house.",
      "Promising itself that he would not stay in the forest for a long time, and saying goodbye to the house, the Robot moved into the thick of the forest, to meet everything new."
    ]
  }
]