{
  "Items": [
    {
      "Title": "Начало",
      "Info": "     Привет, игрок! Добро пожаловать в <color=green>Coding Learn</color> - игру, где ты сможешь освоить азы программирования на <color=green>C#</color>, одном из самых популярных языков.\n     Тебе предстоит решать задачи при помощи написания кода, чтобы помочь главному герою - <color=green>роботу-помощнику</color> - преодолевать препятствия на его пути и продолжить его историю.\n     Сейчас расскажем немного подробнее.",
      "VideoTitles": ""
    },
    {
      "Title": "Обучение. Задание",
      "Info": "     Во время выполнения задания ты можешь увидеть его описание в <color=green>левом верхнем углу</color>. Кроме того, нажав на <color=green>серую кнопку</color> в углу, можно снова получить дополнительную информацию, которая появляется перед заданием.",
      "VideoTitles": "Game Training Task"
    },
    {
      "Title": "Обучение. Планшет",
      "Info": "     Для программирования нам нужен какой-нибудь инструмент, поэтому тебе доступен многофункциональный <color=green>планшет</color>. Чтобы включить его, достаточно <color=green>нажать на него</color>.",
      "VideoTitles": "Game Training Turn Pad On"
    },
    {
      "Title": "Обучение. Написание кода",
      "Info": "     Большую часть экрана планшета занимает поле для кода, здесь и происходит самое главное - <color=green>программирование</color>.",
      "VideoTitles": "Game Training Coding"
    },
    {
      "Title": "Обучение. Сброс кода",
      "Info": "     Если тебе вдруг кажется, что решение задачи зашло куда-то не туда, можно быстро вернуться к начальному коду с помощью кнопки <color=green>Сброс кода</color>.",
      "VideoTitles": "Game Training Reset Code"
    },
    {
      "Title": "Обучение. Подсказки",
      "Info": "     В случае, если непонятно, как решать задачу, ты можешь получить <color=green>подсказку</color>. Каждая подсказка становится доступна через несколько минут, поэтому лучше пытаться решить задачу самому. К тому же, это просто интереснее!)",
      "VideoTitles": "Game Training Advice Showing"
    },
    {
      "Title": "Обучение. Справочник",
      "Info": "     Решая задачи, ты будешь узнавать много нового о языке программирования. Чтобы ничего не забыть, ты можешь почитать специальный <color=green>справочник</color>, где собирается всё, что ты изучил ранее.",
      "VideoTitles": "Game Training Handbook"
    },
    {
      "Title": "Обучение. Испытания",
      "Info": "     Чтобы решать задачи было интересно, для каждой из них доступны <color=green>испытания</color>. За прохождение каждого ты будешь получать <color=green>звёзды</color>. Попробуй получить их все!",
      "VideoTitles": "Game Training Challenges"
    },
    {
      "Title": "Обучение. Ошибки",
      "Info": "     Если в коде ты вдруг допустишь <color=green>ошибку</color>, среда разработки сообщит тебе об этом, показав <color=green>сообщение</color> в нижней части экрана.",
      "VideoTitles": "Game Training Errors"
    },
    {
      "Title": "Обучение. Сворачивание планшета",
      "Info": "     Кнопка в <color=green>верхнем правом углу</color> планшета сворачивает его. Так ты сможешь увидеть локацию во время задания, что может быть иногда полезно - подсказки могут быть <color=green>повсюду</color>!",
      "VideoTitles": "Game Training Turn Pad Off"
    },
    {
      "Title": "Первое задание",
      "Info": "     Ну а теперь пришла пора программировать! Мы приготовили для тебя первую задачу, но не стоит бояться - она, разумеется, очень простая.",
      "VideoTitles": ""
    }
  ]
}