[
  {
    "LinkedContentID": "Story_L7_P1",
    "Articles": [
      "Робот добрался до гущи леса, где был сигнал о помощи ему оставалось лишь найти где-то рядом его источник",
      "Немного походив по лесу, он нашел источник сигнала - им оказался другой робот, который не может двигаться из-за того, что у него перегорел чип, который регулирует нижние конечности",
      "Робот узнал от потерпевшего, что запасной чип находится в одном из трех мест",
      "Робот решил записать эти координаты, чтобы помочь роботу попавшему в беду"
    ]
  },
  {
    "LinkedContentID": "Story_L7_P2",
    "Articles": [
      "Робот решает по очереди пройти эти места и начинает свой путь",
      "Первым местом становится хижина робота, возможно в ней что-то лежит",
      "Он обыскивает ее и ничего в ней не находит, но остались еще два места",
      "Он хочет вычеркнуть эту хижину из мест, в которых он побывал"
    ]
  },
  {
    "LinkedContentID": "Story_L7_P3",
    "Articles": [
      "Робот вычеркнул хижину из мест в которых он побывал, остались еще два",
      "Пройдя по дороге он находит небольшое дерево, которое отметил раненный робот, он осматривает его и не находит чего-то ценного",
      "Робот случайно заметил конорку и собирается дойти до нее",
      "Теперь ему нуэно записать ее для осмотра тоже, чтобы построить маршут до нее"
    ]
  },
  {
    "LinkedContentID": "Story_L7_P4",
    "Articles": [
      "Робот дошел до конорки и приступил к ее анализу",
      "Как вдруг, ему на глаза попался чемоданчик с микросхемам",
      "Теперь ему нужно выбрать нужную микросхему для раненного робота"
    ]
  },
  {
    "LinkedContentID": "Story_L7_P5",
    "Articles": [
      "Робот выбрал красноватую микросхему и направился к ослабленному роботу",
      "Он передал ему микросхему и раненной робот попросил еще раз о помощи",
      "На этот раз нашему герою нужно перести старые настройки на новую микросхему"
    ]
  },
  {
    "LinkedContentID": "Story_L7_P6",
    "Articles": [
      "Робот успешно подключил нужные настройки в микросхему робота",
      "Робот попросил своего нового знакомого о помощи, он рассказал, что он хочет найти сокровища, но точно не знает, как правильно дойти до нужного места",
      "Робот рассказал, что руины старого замка находятся за большим хребтом и маловероятно, что роботу удастся перелезть через него. Но при этом, чтобы его обойти скорее всего не хватит заряда батареи. Но здесь есть полуразрушенная шахта, на которой когда-то работал этот робот, он соглашается его провести до него. Робот сообщает, что он, конечно, нашел микросхему, но из-за того, что он тратит энергию и не восстанавливает ее, его заряд батареи меньше одного дня.",
      "Новый знакомый провожает его до своей хижины и внутри хижины предлагает зарядить батарею. Робот начинает крутить устройство похожее на колеса велосипеда и заряжать ячейку для робота, которую хочет вставить, но при этом он просит, чтобы батарейка заработала без сбоев указать старый заряд и модель робота."
    ]
  },
  {
    "LinkedContentID": "Story_L7_P7",
    "Articles": [
      "Робот заполнил информацию и через пару минут он уже был с новой батареей, ее заряда хватит на продолжительное время и о ней можно не волноваться",
      "Они прошли с роботом дальше по тропинке и тут его остановил новый знакомый",
      "Он сказал, что шахта для существа, которое в ней никогда не было, может быть губительна и решил сказать ему дорогу, как правильно ориентироваться в шахте"
    ]
  },
  {
    "LinkedContentID": "Story_L7_P8",
    "Articles": [
      "Робот сказал, что запомнил, то, что сказал ему другой робот и поблагодарил его за данные.",
      "Другой робот повторил, что дальше с ним не пойдет, так как ему нужно приглядывать за котиком, который сидит в его хижине.",
      "Также он сообщил, что у него есть идея, как дойти роботу до шахты и что он помнит маршут, не смотря на то, что как таковой тропинки до шахт нет, но при этом может заново назвать место, которое уже называл и их не нужно учитывать в походе до шахты"
    ]
  },
  {
    "LinkedContentID": "Story_L7_P9",
    "Articles": [
      "Робот нашел в словах другого робота несколько повторов и понял, что до шахты осталось пройти совсем чуть-чуть",
      "Он сразу направился в ее сторону, скоро начнется путь через подземелья"
    ]
  }
]
