[
  {
    "Articles": [
      "After getting out of the thick of the forest, the robot went to the river that flowed nearby.",
      "Going further down the path, he saw a turn.",
      "And there was a small dock around the corner.",
      "But there was one trouble, broken trees blocked the passage",
      "The robot decided to look what is stored in the boxes, maybe there is something useful there"
    ]
  },
  {
    "Articles": [
      "The robot was able to open one of the drawers",
      "Now it remains to see what lies there"
    ]
  },
  {
    "Articles": [
      "Robot found an ax in a box",
      "All that's left is to cut the fence"
    ]
  },
  {
    "Articles": [
      "The robot went further and saw the bridge",
      "The bridge is disassembled and could do with reassembly"
    ]
  },
  {
    "Articles": [
      "The hardest part is over, you just need to nail the boards in the right places and the bridge will be ready!",
      "The robot looked and realized that he could not swim across the river, because he was not protected from water",
      "He went back to the bridge and started thinking about how to fix it"
    ]
  },
  {
    "Articles": [
      "The bridge was repaired and the robot was able to walk over it",
      "The robot went to the village",
      "In the middle of the village, he saw a gate blocking the way further",
      "The gate could not be opened and the robot went to look around for an item that can open the gate",
      "The robot returned back to the village and moved towards the house",
      "He walked a little",
      "A little more later",
      "And ended up inside"
    ]
  },
  {
    "Articles": [
      "The robot went with the key to the gate",
      "Passed through the village too",
      "But his key didn't work",
      "He went back to the center of the village",
      "And went to the house opposite, hoping to find a suitable key ",
      "When he entered the house, he saw the chests"
    ]
  },
  {
    "Articles": [
      "He got out and walked towards another robot that was in the middle of the village",
      "And tried to turn it on"
    ]
  },
  {
    "Articles": [
      "Taking the key, the robot went to the gate",
      "The gate opened and the robot went uphill"
    ]
  }
]