[
  {
    "LinkedContentID": "Story_L5_P1",
    "Articles": [
      "It was already dawn when the robot saw smoke coming from the chimneys and the roof of the houses nearby. It was a village. And it looks like some of the inhabitants are walking towards it.",
      "It was the old lady who dropped the basket of apples and was trying to pick it up.",
      "The robot approached her to help. The woman was taken aback and stood stock-still, not expecting to see an iron helper here. But the robot, despite this, continued to pick apples."
    ]
  },
  {
    "LinkedContentID": "Story_L5_P2",
    "Articles": [
      "The woman quietly thanked the robot and hurried to the village. Our hero was attracted by the sound of an ax coming from behind the bushes.",
      "The robot went there and met a lumberjack. He had been watching the robot picking apples all this time, and didn't seem to be afraid of the iron stranger at all. On the contrary, he asked the hero for a favor - to take firewood to the trader."
    ]
  },
  {
    "LinkedContentID": "Story_L5_P3",
    "Articles": [
      "The robot did a great job and went on a lumberjack's errand.",
      "The merchant was very close. Our hero gave him firewood, for which he received gratitude from the locals. There were two of them around the fire - the merchant and his friend.",
      "The second suggested that the robot play a card game: take a few cards, memorize them, and then try to draw the highest one in order to defeat the opponent. Our hero's memory was impeccable, and therefore he agreed to play."
    ]
  },
  {
    "LinkedContentID": "Story_L5_P4",
    "Articles": [
      "The iron helper drew the biggest card available, but lost - the merchant's friend had stronger cards. Then the robot decided to end the game and move on.",
      "There was an inn nearby, and the robot decided to ask the workers how to get to the castle in the mountains.",
      "He was no longer feared, but warmly welcomed - the woman who dropped the apples told everyone about the kindness and generosity of the iron man. The tavern worker brought a map and began to show the robot the route."
    ]
  },
  {
    "LinkedContentID": "Story_L5_P5",
    "Articles": [
      "The road to the east led to the castle, but since it was still early in the morning, the robot decided to walk around the village and see what the inhabitants were doing. He was attracted by someone in a black robe.",
      "It was the elder. He goes out every morning to watch the sunrise and see how life begins to boil in the village. The robot asked if he could help the villagers in any way. The elder suggested that the assistant go to the shore and ask the miller and the boatman.",
      "The robot was about to go, but the elder asked to stay a little longer. He was very curious to know a little more about our hero, more precisely, about his mental abilities and ingenuity, and asked a riddle - in which hand does he hold a pebble?"
    ]
  },
  {
    "LinkedContentID": "Story_L5_P6",
    "Articles": [
      "The robot correctly answered the elder's question and moved towards the shore, towards the mill.",
      "He saw a sad miller sitting on a bench. After talking to a villager, the robot found out that the mill had several gears out of order and was therefore not working.",
      "Our hero decided to help the miller and began to inspect a nearby box with various trash and scrap metal. Perhaps an attentive robot will be able to find something suitable to replace it."
    ]
  },
  {
    "LinkedContentID": "Story_L5_P7",
    "Articles": [
      "All suitable parts were found, and after a while the miller was able to repair the windmill. Warmly thanking the robot, he began to admire the mechanism again working, and our hero decided to walk to the boatman.",
      "Looks like he could use some help too. He just finished building a few boats and needed to see how much cargo they could hold on the water. Our hero would be really handy here."
    ]
  },
  {
    "LinkedContentID": "Story_L5_P8",
    "Articles": [
      "The job was successfully completed. It was already daylight, so now you can move on. The robot returned to the center of the village and found the right path.",
      "The robot has taken this road on an adventure",
      "The robot said goodbye to those who met on its way and left this place and moved on. It was getting closer to the mountains, where the treasure castle was waiting for him."
    ]
  }
]