{
  "Items": [
    {
      "Title": "Arrays in C#",
      "Info": "So, at the moment we know what a variable is, how its type is set, and how to initialize a variable. Now that we know what types of loops are available in C # and how they differ, we can study in detail issues related to using <color=green>arrays</color> C#.Suppose you need to store 10 integer values in your program.On the one hand, if you are not too lazy, you can declare 10 int variables, initialize them and work.And what to do if you want 100 values or 1000? You can make it simpler by declaring an array variable and storing all the values in it.<color=green>Array</color> is a fixed size data structure to hold an element of a particular type. array is produced by numeric index. ",
      "VideoTitles": " "
    },
    {
      "Title": "Declaring arrays",
      "Info": "To declare an array, after specifying the type of its elements, put <color=green>square brackets</color>:\n int[] a1;\n Before using the array, you must first <color=green>initialize</ color>, this can be done immediately, when it is declared. Examples of declaring arrays in the video. ",
      "VideoTitles": "m1"
    },
    {
      "Title": "Accessing array elements. Traversing array elements.",
      "Info": "<color=green>indexes</color> are used to refer to array elements. Index represents the number of the element in the array, numbering starts from zero, so the index of the first element will be 0, the index of the fourth element will be 3. In this case, if you specify an index greater than the maximum possible, an exception will be thrown.\n Array elements can be traversed using <color=green>for, foreach and while</color> loops, the last one is the most inconvenient for working with arrays , we will not consider it.If you are working with a for loop, then you can use the <color=green>Length</color> property of the array to specify the upper bound of the variable being incremented.Each array has a Length property that stores the length of the array.The advantage of the loop for is that you can modify array elements in it. ",
      "VideoTitles": "m2"
    }
  ]
}